Weird, working fine for me...

```
terraform apply
rancher2_catalog.elastic: Refreshing state... [id=local:elastic]
rancher2_catalog.jetstack_cluster: Refreshing state... [id=local:jetstack-test]
rancher2_namespace.foo: Refreshing state... [id=foo]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rancher2_app.kibana will be created
  + resource "rancher2_app" "kibana" {
      + annotations      = (known after apply)
      + catalog_name     = "local:elastic"
      + description      = (known after apply)
      + external_id      = (known after apply)
      + force_upgrade    = false
      + id               = (known after apply)
      + labels           = (known after apply)
      + name             = "kibana"
      + project_id       = "local:p-tqz59"
      + revision_id      = (known after apply)
      + target_namespace = "foo"
      + template_name    = "kibana"
      + template_version = "7.6.2"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_app.kibana: Creating...
rancher2_app.kibana: Still creating... [10s elapsed]
rancher2_app.kibana: Creation complete after 15s [id="p-tqz59:kibana"]
```